       identification division.
       program-id. "HELLOWORLD".
       author. SIMON VARGAS
      *This is a comment in COBOL
      *Columns 8-11 A margin
      *Columns 12-72 B margin
       environment division.

       data division.

       procedure division.
       0100-START-HERE.
           display "Hello World!".
       STOP RUN.
       end program HELLOWORLD.
        
